app/controllers/admin/coffee_types_controller.rb

	def index
		@coffee_types = CoffeeType.all
---
SELECT "coffee_types".* FROM "coffee_types"

	def create
		@coffeetype = CoffeeType.new(params[:coffee_type])
		@coffeetype.save
---
INSERT INTO "coffee_types" ("created_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 13 Mar 2012 18:07:22 UTC +00:00], ["name", nil], ["price", nil], ["updated_at", Tue, 13 Mar 2012 18:07:22 UTC +00:00]]

	def destroy
		@coffee_article = CoffeeType.find(params[:id])
		@coffee_article.destroy
---
SELECT "coffee_types".* FROM "coffee_types" WHERE "coffee_types"."id" = $1 LIMIT 1  [["id", "15"]]
DELETE FROM "coffee_types" WHERE "coffee_types"."id" = $1  [["id", 15]]