app/controllers/admin/gmaps_controller.rb

  def index
  	@coordinates = Coordinate.all
---
SELECT "coordinates".* FROM "coordinates"

  def create
  	@coordinate = Coordinate.new(params[:coordinate])
  	@coordinate.save
---
INSERT INTO "coordinates" ("created_at", "lat", "long", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 15 Mar 2012 21:51:47 UTC +00:00], ["lat", 44.567125], ["long", 33.525553], ["updated_at", Thu, 15 Mar 2012 21:51:47 UTC +00:00]]

  def destroy
    @coordinate = Coordinate.find(params[:id])
    if @coordinate.destroy
---
SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "coordinates" WHERE "coordinates"."id" = $1  [["id", 1]]