app/controllers/admin/images_controller.rb

  def index
  	@paintings = Painting.all
---
SELECT "paintings".* FROM "paintings"

  def create
  		@painting = Painting.new(params[:painting])
  		@painting.save
---
INSERT INTO "paintings" ("created_at", "image", "main", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 15 Mar 2012 16:35:19 UTC +00:00], ["image", "842.jpg"], ["main", true], ["updated_at", Thu, 15 Mar 2012 16:35:19 UTC +00:00]]

  def destroy
    @painting = Painting.find(params[:id])
    respond_to do |format|
      if @painting.destroy
---
SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT 1  [["id", "8"]]
DELETE FROM "paintings" WHERE "paintings"."id" = $1  [["id", 8]]