app/controllers/admin/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
  	@place = Place.all

INSERT INTO "places" ("created_at", "lat", "long", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 16 Mar 2012 16:25:06 UTC +00:00], ["lat", 0.0], ["long", 0.0], ["updated_at", Fri, 16 Mar 2012 16:25:06 UTC +00:00]]
---
  def create
  	@place = Place.new(params[:place])
  	@place.save

SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 1]]
---
  def destroy
    @place = Place.find(params[:id])
    if @place.destroy