app/controllers/pages_controller.rb

  def price
    @title = "Coffee Price"
    @coffee_articles = CoffeeType.all
---
SELECT "coffee_types".* FROM "coffee_types"