app/controllers/places_controller.rb

  def get_places
  	@places = Place.all
---
SELECT "places".* FROM "places"